<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"86131ff267bb7d629cbdc23fbe379626fe54a1d5a0c1d8030a95e69a38f08fc1","plan_job_ref":"Job Plan Airflow DAGs #32 at https://github.com/cal-itp/data-infra/actions/runs/14759788866","plan_out_hash":"3be4562362c068ef5afe978ba4642c240971e3072eee5325f0f1eb12ce22f46a","plan_hash":"d196cea0b8361038abaa4c2b547f88925f00a46d5ec71254e9830126edb812d5","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 23 to add, 0 to change, 25 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/dags.py"] will be destroyed
  # (because key ["dags/dags.py"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "V+xkzQ==" -> null
-       detect_md5hash      = "SL93gm1N+OaknVc3XHi35g==" -> null
-       event_based_hold    = false -> null
-       id                  = "calitp-staging-composer-dags/dags.py" -> null
-       md5hash             = "SL93gm1N+OaknVc3XHi35g==" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fdags.py?generation=1745872957326731&alt=media" -> null
-       name                = "dags/dags.py" -> null
-       output_name         = "dags/dags.py" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fdags.py" -> null
-       source              = "../../../../airflow/dags/dags.py" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (5 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/dbt_dags.py"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/dbt_dags.py"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/dbt_dags.py"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/deploy_dbt_docs/deploy_dbt_docs_site.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "JC82Qw==" -> (known after apply)
!~      detect_md5hash      = "F4KqcWmJ7ISBNaUFO/zOjw==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "*********************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "F4KqcWmJ7ISBNaUFO/zOjw==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fdeploy_dbt_docs%2Fdeploy_dbt_docs_site.yml?generation=1745872956641216&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/deploy_dbt_docs/deploy_dbt_docs_site.yml"
!~      output_name         = "dags/deploy_dbt_docs/deploy_dbt_docs_site.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fdeploy_dbt_docs%2Fdeploy_dbt_docs_site.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/deploy_dbt_docs/sync_dbt_docs_to_metabase.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "p/E4Rw==" -> (known after apply)
!~      detect_md5hash      = "L2fd354Z4l7lzk7v0NUGDg==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "**************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "L2fd354Z4l7lzk7v0NUGDg==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fdeploy_dbt_docs%2Fsync_dbt_docs_to_metabase.yml?generation=1745872957357460&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/deploy_dbt_docs/sync_dbt_docs_to_metabase.yml"
!~      output_name         = "dags/deploy_dbt_docs/sync_dbt_docs_to_metabase.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fdeploy_dbt_docs%2Fsync_dbt_docs_to_metabase.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/gusty_dags.py"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/gusty_dags.py"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/gusty_dags.py"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/macros.py"] will be destroyed
  # (because key ["dags/macros.py"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "GQTkpw==" -> null
-       detect_md5hash      = "pgpC9FAunt6Wi9JJ0Vx/qw==" -> null
-       event_based_hold    = false -> null
-       id                  = "calitp-staging-composer-dags/macros.py" -> null
-       md5hash             = "pgpC9FAunt6Wi9JJ0Vx/qw==" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fmacros.py?generation=1745872955091572&alt=media" -> null
-       name                = "dags/macros.py" -> null
-       output_name         = "dags/macros.py" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fmacros.py" -> null
-       source              = "../../../../airflow/dags/macros.py" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (5 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/parse_and_validate_rt_v2/parse_rt_service_alerts.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "+9dFcg==" -> (known after apply)
!~      detect_md5hash      = "97rkFLQBeG120U93YBpy8g==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "*********************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "97rkFLQBeG120U93YBpy8g==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fparse_and_validate_rt_v2%2Fparse_rt_service_alerts.yml?generation=1745872954601098&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/parse_and_validate_rt_v2/parse_rt_service_alerts.yml"
!~      output_name         = "dags/parse_and_validate_rt_v2/parse_rt_service_alerts.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fparse_and_validate_rt_v2%2Fparse_rt_service_alerts.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/parse_and_validate_rt_v2/parse_rt_trip_updates.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "DA3Oyg==" -> (known after apply)
!~      detect_md5hash      = "D1SUCcZm8WhEJB5y6Gw1Qg==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "*******************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "D1SUCcZm8WhEJB5y6Gw1Qg==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fparse_and_validate_rt_v2%2Fparse_rt_trip_updates.yml?generation=1745872953019126&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/parse_and_validate_rt_v2/parse_rt_trip_updates.yml"
!~      output_name         = "dags/parse_and_validate_rt_v2/parse_rt_trip_updates.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fparse_and_validate_rt_v2%2Fparse_rt_trip_updates.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/parse_and_validate_rt_v2/parse_rt_vehicle_positions.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "BOzg8Q==" -> (known after apply)
!~      detect_md5hash      = "KIISaZeHvFeUlvMmxV8GRQ==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "************************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "KIISaZeHvFeUlvMmxV8GRQ==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fparse_and_validate_rt_v2%2Fparse_rt_vehicle_positions.yml?generation=1745872956894455&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/parse_and_validate_rt_v2/parse_rt_vehicle_positions.yml"
!~      output_name         = "dags/parse_and_validate_rt_v2/parse_rt_vehicle_positions.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fparse_and_validate_rt_v2%2Fparse_rt_vehicle_positions.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/parse_and_validate_rt_v2/validate_rt_service_alerts.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "wrLw/A==" -> (known after apply)
!~      detect_md5hash      = "euh4xdX0XvjvqfDGYN22ng==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "************************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "euh4xdX0XvjvqfDGYN22ng==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fparse_and_validate_rt_v2%2Fvalidate_rt_service_alerts.yml?generation=1745872956875466&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/parse_and_validate_rt_v2/validate_rt_service_alerts.yml"
!~      output_name         = "dags/parse_and_validate_rt_v2/validate_rt_service_alerts.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fparse_and_validate_rt_v2%2Fvalidate_rt_service_alerts.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/parse_and_validate_rt_v2/validate_rt_trip_updates.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "HWExmw==" -> (known after apply)
!~      detect_md5hash      = "IUxnswbY/fkJlvS1vp0d6g==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "**********************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "IUxnswbY/fkJlvS1vp0d6g==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fparse_and_validate_rt_v2%2Fvalidate_rt_trip_updates.yml?generation=1745872953660133&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/parse_and_validate_rt_v2/validate_rt_trip_updates.yml"
!~      output_name         = "dags/parse_and_validate_rt_v2/validate_rt_trip_updates.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fparse_and_validate_rt_v2%2Fvalidate_rt_trip_updates.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/parse_and_validate_rt_v2/validate_rt_vehicle_positions.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "xSAsOw==" -> (known after apply)
!~      detect_md5hash      = "lSjz6Jb/BWo11bwTqrEj5g==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "***************************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "lSjz6Jb/BWo11bwTqrEj5g==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fparse_and_validate_rt_v2%2Fvalidate_rt_vehicle_positions.yml?generation=1745872953009438&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/parse_and_validate_rt_v2/validate_rt_vehicle_positions.yml"
!~      output_name         = "dags/parse_and_validate_rt_v2/validate_rt_vehicle_positions.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fparse_and_validate_rt_v2%2Fvalidate_rt_vehicle_positions.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/publish_open_data/publish_california_open_data.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "FFP1AA==" -> (known after apply)
!~      detect_md5hash      = "3WAik+bMVc1LLndK+tqzRA==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "*******************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "3WAik+bMVc1LLndK+tqzRA==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fpublish_open_data%2Fpublish_california_open_data.yml?generation=1745872956560463&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/publish_open_data/publish_california_open_data.yml"
!~      output_name         = "dags/publish_open_data/publish_california_open_data.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fpublish_open_data%2Fpublish_california_open_data.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/scrape_feed_aggregators/scrape_mobility_database.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "bMUt7w==" -> (known after apply)
!~      detect_md5hash      = "XmdfD94aKcSZiuie8rpqDA==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "*********************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "XmdfD94aKcSZiuie8rpqDA==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fscrape_feed_aggregators%2Fscrape_mobility_database.yml?generation=1745872954481250&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/scrape_feed_aggregators/scrape_mobility_database.yml"
!~      output_name         = "dags/scrape_feed_aggregators/scrape_mobility_database.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fscrape_feed_aggregators%2Fscrape_mobility_database.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/scrape_feed_aggregators/scrape_transitland.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "mQ+pJQ==" -> (known after apply)
!~      detect_md5hash      = "c71P1xBL1mnOQexldUMkTA==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "***************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "c71P1xBL1mnOQexldUMkTA==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Fscrape_feed_aggregators%2Fscrape_transitland.yml?generation=1745872957316936&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/scrape_feed_aggregators/scrape_transitland.yml"
!~      output_name         = "dags/scrape_feed_aggregators/scrape_transitland.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Fscrape_feed_aggregators%2Fscrape_transitland.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse/dbt_run_and_upload_artifacts.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "dkIHkg==" -> (known after apply)
!~      detect_md5hash      = "QUwaek8s7baKgLD7MAzNyw==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "*********************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "QUwaek8s7baKgLD7MAzNyw==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse%2Fdbt_run_and_upload_artifacts.yml?generation=1745872954593074&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/transform_warehouse/dbt_run_and_upload_artifacts.yml"
!~      output_name         = "dags/transform_warehouse/dbt_run_and_upload_artifacts.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse%2Fdbt_run_and_upload_artifacts.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse/dbt_test.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "0hMCRw==" -> (known after apply)
!~      detect_md5hash      = "DfXlkqijZx7/qzaUCzArlQ==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "*************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "DfXlkqijZx7/qzaUCzArlQ==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse%2Fdbt_test.yml?generation=1745872952882222&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/transform_warehouse/dbt_test.yml"
!~      output_name         = "dags/transform_warehouse/dbt_test.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse%2Fdbt_test.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh/dbt_run_and_upload_artifacts.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "iwvqNw==" -> (known after apply)
!~      detect_md5hash      = "aMznTu0zTl3orEQXkIqukA==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "**********************************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "aMznTu0zTl3orEQXkIqukA==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh%2Fdbt_run_and_upload_artifacts.yml?generation=1745872955449272&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/transform_warehouse_full_refresh/dbt_run_and_upload_artifacts.yml"
!~      output_name         = "dags/transform_warehouse_full_refresh/dbt_run_and_upload_artifacts.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh%2Fdbt_run_and_upload_artifacts.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh/dbt_test.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "ahhNSA==" -> (known after apply)
!~      detect_md5hash      = "exjtvvs4MBl1RLoUuLd9Ow==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "**************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "exjtvvs4MBl1RLoUuLd9Ow==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh%2Fdbt_test.yml?generation=1745872957185084&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/transform_warehouse_full_refresh/dbt_test.yml"
!~      output_name         = "dags/transform_warehouse_full_refresh/dbt_test.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh%2Fdbt_test.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_full_refresh_exclude_rt.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "/rgilg==" -> (known after apply)
!~      detect_md5hash      = "jAy47bS/n0FaRf/3WNQkMA==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "*****************************************************************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "jAy47bS/n0FaRf/3WNQkMA==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh_sunday%2Fdbt_run_and_upload_artifacts_full_refresh_exclude_rt.yml?generation=1745872955588002&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_full_refresh_exclude_rt.yml"
!~      output_name         = "dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_full_refresh_exclude_rt.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh_sunday%2Fdbt_run_and_upload_artifacts_full_refresh_exclude_rt.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_select_rt.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "XtsmKA==" -> (known after apply)
!~      detect_md5hash      = "dOHQKwMqLLENCsEX3M+MLA==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "***************************************************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "dOHQKwMqLLENCsEX3M+MLA==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh_sunday%2Fdbt_run_and_upload_artifacts_select_rt.yml?generation=1745872953895163&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_select_rt.yml"
!~      output_name         = "dags/transform_warehouse_full_refresh_sunday/dbt_run_and_upload_artifacts_select_rt.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh_sunday%2Fdbt_run_and_upload_artifacts_select_rt.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh_sunday/dbt_test_exclude_rt.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "WyWr4g==" -> (known after apply)
!~      detect_md5hash      = "bheD0VBwFINSAhqUStjXzQ==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "********************************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "bheD0VBwFINSAhqUStjXzQ==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh_sunday%2Fdbt_test_exclude_rt.yml?generation=1745872953610886&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/transform_warehouse_full_refresh_sunday/dbt_test_exclude_rt.yml"
!~      output_name         = "dags/transform_warehouse_full_refresh_sunday/dbt_test_exclude_rt.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh_sunday%2Fdbt_test_exclude_rt.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/transform_warehouse_full_refresh_sunday/dbt_test_select_rt.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "AXNrEg==" -> (known after apply)
!~      detect_md5hash      = "tO9DzwfFHfcpb0uAp4ZQbg==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "*******************************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "tO9DzwfFHfcpb0uAp4ZQbg==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh_sunday%2Fdbt_test_select_rt.yml?generation=1745872954952466&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/transform_warehouse_full_refresh_sunday/dbt_test_select_rt.yml"
!~      output_name         = "dags/transform_warehouse_full_refresh_sunday/dbt_test_select_rt.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Ftransform_warehouse_full_refresh_sunday%2Fdbt_test_select_rt.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/unzip_and_validate_gtfs_schedule_hourly/validate_gtfs_schedule.yml"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "h9bsug==" -> (known after apply)
!~      detect_md5hash      = "vsRlBPrkvjG2TTv2o6ePFg==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "***********************************************************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "vsRlBPrkvjG2TTv2o6ePFg==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/dags%2Funzip_and_validate_gtfs_schedule_hourly%2Fvalidate_gtfs_schedule.yml?generation=1745872957039977&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "dags/unzip_and_validate_gtfs_schedule_hourly/validate_gtfs_schedule.yml"
!~      output_name         = "dags/unzip_and_validate_gtfs_schedule_hourly/validate_gtfs_schedule.yml" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/dags%2Funzip_and_validate_gtfs_schedule_hourly%2Fvalidate_gtfs_schedule.yml" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/conftest.py"] will be destroyed
  # (because key ["plugins/conftest.py"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "AAAAAA==" -> null
-       detect_md5hash      = "1B2M2Y8AsgTpgAmY7PhCfg==" -> null
-       event_based_hold    = false -> null
-       id                  = "calitp-staging-composer-plugins/conftest.py" -> null
-       md5hash             = "1B2M2Y8AsgTpgAmY7PhCfg==" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/plugins%2Fconftest.py?generation=1745872956926613&alt=media" -> null
-       name                = "plugins/conftest.py" -> null
-       output_name         = "plugins/conftest.py" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/plugins%2Fconftest.py" -> null
-       source              = "../../../../airflow/plugins/conftest.py" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (5 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/libs/__init__.py"] will be destroyed
  # (because key ["plugins/libs/__init__.py"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-staging-composer" {
-       bucket              = "calitp-staging-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "AAAAAA==" -> null
-       detect_md5hash      = "1B2M2Y8AsgTpgAmY7PhCfg==" -> null
-       event_based_hold    = false -> null
-       id                  = "calitp-staging-composer-plugins/libs/__init__.py" -> null
-       md5hash             = "1B2M2Y8AsgTpgAmY7PhCfg==" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/plugins%2Flibs%2F__init__.py?generation=1745872956059728&alt=media" -> null
-       name                = "plugins/libs/__init__.py" -> null
-       output_name         = "plugins/libs/__init__.py" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/plugins%2Flibs%2F__init__.py" -> null
-       source              = "../../../../airflow/plugins/libs/__init__.py" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (5 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/pod_operator.py"] must be replaced
-/+ resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      content_type        = "text/plain; charset=utf-8" -> (known after apply)
!~      crc32c              = "/j25FA==" -> (known after apply)
!~      detect_md5hash      = "LzDJZ2zJvO0sqxN5L6EYrw==" -> "different hash" # forces replacement
-       event_based_hold    = false -> null
!~      id                  = "*********************************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "LzDJZ2zJvO0sqxN5L6EYrw==" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-staging-composer/o/plugins%2Foperators%2Fpod_operator.py?generation=1745872957042866&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "plugins/operators/pod_operator.py"
!~      output_name         = "plugins/operators/pod_operator.py" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-staging-composer/o/plugins%2Foperators%2Fpod_operator.py" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

Plan: 23 to add, 0 to change, 25 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #32](https://github.com/cal-itp/data-infra/actions/runs/14759788866)